In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [3]:
students_performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
# вывести первые 5 строк:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
# вывести заданное количество строк:
students_performance.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [6]:
# вывести последние 5 строк:
students_performance.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [7]:
# вывести описательные статистики для количественных переменных
students_performance.describe()
# describe() и др. вызовы с() - это ф-ции - позволяют что-то сделать с данными

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
# вывести переменные и их типы
students_performance.dtypes
# dtypes - это атрибут, он позволяет посмотреть что хранится в данных

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [9]:
# вывести размер таблицы (строки, столбцы)
students_performance.shape

(1000, 8)

In [10]:
students_performance.groupby('gender').aggregate({'writing score' : 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [11]:
# обращение к нужным строкам/столбцам по индексам (второе значение не включено в интервал)
students_performance.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [12]:
students_performance.iloc[[0, 3, 10], [0, 5, -1]]

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [13]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]

In [14]:
# обращение к нужным строкам/столбцам по названиям
# в таблице как в SQL есть автоматические индексы строк
# чтобы к строке можно было обращаться по имени, можно эти индексы переделать в названия:
students_performance_with_names.index = ['Irina', 'Petr', 'Gregor', 'Maxim', 'Ilya']

In [15]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Irina,female,group B,bachelor's degree,standard,none,72,72,74
Petr,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Maxim,male,group B,some college,free/reduced,none,40,43,39
Ilya,male,group D,high school,free/reduced,completed,64,64,67

In [16]:
# если индексы не переименованы с помощью атрибута loc можно обращаться по аналогии с iloc, чер номера по умлочанию. Но в отличие от iloc, второе значение в векторе 0:5 будет включено в вывод
# теперь с помощью атрибута loc можно обращаться к данным по названиям строк/колонок:
students_performance_with_names.loc[['Irina', 'Maxim'], ['gender', 'writing score']]

       gender  writing score
Irina  female             74
Maxim    male             39

In [17]:
# Series(Серия), в отличие от датафреймов, которые были выше, это одномерный массив с именами.
# !!! А датафрейм - это объединенные пандовские серии (каждая колонка - серия) !!!
students_performance_with_names.iloc[:, 0]
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [18]:
# Серии можно создавать по-отдельности:
my_series_1 = pd.Series([1, 2, 3], index=['Irina', 'Maxim', 'Gregor'])
my_series_2 = pd.Series([4, 5, 6], index=['Irina', 'Maxim', 'Gregor'])
# ... и объединять их в датафреймы (похоже на словарь в питоне):
pd.DataFrame({'col_name_1':my_series_1, 'col_name_2':my_series_2})

        col_name_1  col_name_2
Irina            1           4
Maxim            2           5
Gregor           3           6

In [19]:
# !!! Такой запрос вернет серию:
students_performance_with_names['gender']
# !!! Такой запрос вернет колонку из датафрейма:
students_performance_with_names[['gender']]

        gender
Irina   female
Petr      male
Gregor    male
Maxim     male
Ilya      male

In [20]:
# Задание на шаге 1.4.10
titanic_ds = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')

In [21]:
titanic_ds

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
# посмотреть число строк и колонок
titanic_ds.shape

(891, 12)

In [23]:
# посчитать количество переменных каждого типа
titanic_ds.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [23]:
...